## Module 3: DataFrames and Data Wrangling

## Creating DataFrames

In [1]:
# Using Dictionaries
import pandas as pd

# Create a dictionary of data
data = {
    'Age': [25, 30],
    'Income': [55000, 65000],
    'Expenditure': [30000, 45000]
}

# Create a DataFrame using the data and specifying index labels
df = pd.DataFrame(data, index=['Alice', 'Bob'])

print(df)

       Age  Income  Expenditure
Alice   25   55000        30000
Bob     30   65000        45000

In [2]:
# Using Lists
import pandas as pd

# Data in the form of a list of lists
data = [
    ['Alice', 25, 'Engineer'],
    ['Bob', 30, 'Data Scientist'],
    ['Charlie', 28, 'Designer']
]

# Convert the list of lists to a DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age', 'Profession'])

print(df)

      Name  Age      Profession
0    Alice   25        Engineer
1      Bob   30  Data Scientist
2  Charlie   28        Designer

In [3]:
# Using .csv files
# Upload and read the sample_data.csv file
# Import necessary libraries
import pandas as pd

# Read the CSV file into a DataFrame
df = pd.read_csv('./Data/sample_data.csv')

# Display the DataFrame
print(df)

      Name  Age      Profession
0    Alice   25        Engineer
1      Bob   30  Data Scientist
2  Charlie   28        Designer

## Accessing Rows and Columns

In [4]:
import pandas as pd

# Create a dictionary of data
data = {
    'Age': [25, 30],
    'Income': [55000, 65000],
    'Expenditure': [30000, 45000]
}

# Create a DataFrame using the data and specifying index labels
df = pd.DataFrame(data, index=['Alice', 'Bob'])

print(df)

       Age  Income  Expenditure
Alice   25   55000        30000
Bob     30   65000        45000

In [5]:
# Selecting rows using labels
df.loc ['Alice']

Age               25
Income         55000
Expenditure    30000
Name: Alice, dtype: int64

In [6]:
# Selecting rows using index position
df.iloc [0]

Age               25
Income         55000
Expenditure    30000
Name: Alice, dtype: int64

In [7]:
# Selecting columns using labels
df.loc [:, 'Income']

Alice    55000
Bob      65000
Name: Income, dtype: int64

In [8]:
# Selecting columns using index position
df.iloc [:, 1]

Alice    55000
Bob      65000
Name: Income, dtype: int64

In [9]:
# Slicing operation
df.loc ['Alice', 'Income' : 'Expenditure']

Income         55000
Expenditure    30000
Name: Alice, dtype: int64

In [10]:
df.iloc [0, 1:3]

Income         55000
Expenditure    30000
Name: Alice, dtype: int64

## Checking datatypes

In [11]:
df.dtypes

Age            int64
Income         int64
Expenditure    int64
dtype: object

## Aggregate Statistics

In [12]:
df.describe()

             Age        Income   Expenditure
count   2.000000      2.000000      2.000000
mean   27.500000  60000.000000  37500.000000
std     3.535534   7071.067812  10606.601718
min    25.000000  55000.000000  30000.000000
25%    26.250000  57500.000000  33750.000000
50%    27.500000  60000.000000  37500.000000
75%    28.750000  62500.000000  41250.000000
max    30.000000  65000.000000  45000.000000

## Handling missing values

In [13]:
import pandas as pd
import numpy as np

# Sample data with missing values
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, np.nan, 28, 30, 29],
    'Profession': ['Engineer', 'Data Scientist', 'Designer', None, 'Manager'],
    'Salary': [5000, 5500, np.nan, 6300, 6100]
}

# Create the DataFrame
df = pd.DataFrame(data)

print(df)

      Name   Age      Profession  Salary
0    Alice  25.0        Engineer  5000.0
1      Bob   NaN  Data Scientist  5500.0
2  Charlie  28.0        Designer     NaN
3    David  30.0            None  6300.0
4      Eve  29.0         Manager  6100.0

In [14]:
df.isnull()

    Name    Age  Profession  Salary
0  False  False       False   False
1  False   True       False   False
2  False  False       False    True
3  False  False        True   False
4  False  False       False   False

In [15]:
df.isnull().sum()

Name          0
Age           1
Profession    1
Salary        1
dtype: int64

In [16]:
df.dropna()

    Name   Age Profession  Salary
0  Alice  25.0   Engineer  5000.0
4    Eve  29.0    Manager  6100.0

In [18]:
df

      Name   Age      Profession  Salary
0    Alice  25.0        Engineer  5000.0
1      Bob   NaN  Data Scientist  5500.0
2  Charlie  28.0        Designer     NaN
3    David  30.0            None  6300.0
4      Eve  29.0         Manager  6100.0

In [17]:
df.fillna(value={"Age": 24, "Profession": "Not Known", "Salary": 50000})

      Name   Age      Profession   Salary
0    Alice  25.0        Engineer   5000.0
1      Bob  24.0  Data Scientist   5500.0
2  Charlie  28.0        Designer  50000.0
3    David  30.0       Not Known   6300.0
4      Eve  29.0         Manager   6100.0

## Flitering rows and columns

In [19]:
import pandas as pd

# Sample data for the DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [28, 32, 35, 29, 31],
    'Income': [45000, 52000, 59000, 48000, 51000],
    'Expenditure': [30000, 46000, 50000, 32000, 40000]
}

# Create the DataFrame
df = pd.DataFrame(data)

print(df)

      Name  Age  Income  Expenditure
0    Alice   28   45000        30000
1      Bob   32   52000        46000
2  Charlie   35   59000        50000
3    David   29   48000        32000
4      Eve   31   51000        40000

In [20]:
# Filtering rows by condition
df[df['Age'] > 30]

      Name  Age  Income  Expenditure
1      Bob   32   52000        46000
2  Charlie   35   59000        50000
4      Eve   31   51000        40000

In [21]:
# Filtering columns
df[['Name', 'Age']]

      Name  Age
0    Alice   28
1      Bob   32
2  Charlie   35
3    David   29
4      Eve   31

In [22]:
# Using query function
df.query("Age > 30 & Income > 50000")

      Name  Age  Income  Expenditure
1      Bob   32   52000        46000
2  Charlie   35   59000        50000
4      Eve   31   51000        40000

## Reshaping data

In [23]:
# Wide to long
import pandas as pd

# Sample wide data
data_wide = {
    'Name': ['Alice', 'Bob'],
    'Score_2021': [85, 90],
    'Score_2022': [88, 89]
}
df_wide = pd.DataFrame(data_wide)
df_long = pd.melt(df_wide, id_vars=['Name'], value_vars=['Score_2021', 'Score_2022'],
                  var_name='Year', value_name='Score')
df_long

    Name        Year  Score
0  Alice  Score_2021     85
1    Bob  Score_2021     90
2  Alice  Score_2022     88
3    Bob  Score_2022     89

## Task 1: Try to convert the long form of data table into a wide form

## Merging tables

In [24]:
# Concatination
import pandas as pd

# Sample data
df1 = pd.DataFrame({
    'A': [1, 2],
    'B': [3, 4]
})

df2 = pd.DataFrame({
    'A': [5, 6],
    'B': [7, 8]
})

# Concatenate DataFrames
result = pd.concat([df1, df2])
result

   A  B
0  1  3
1  2  4
0  5  7
1  6  8

In [25]:
# Merging using join operations
import pandas as pd

# Sample data
df_left = pd.DataFrame({
    'key': ['A', 'B', 'C'],
    'value_left': [1, 2, 3]
})

df_right = pd.DataFrame({
    'key': ['A', 'B', 'D'],
    'value_right': [4, 5, 6]
})

# Merge DataFrames
merged_df = pd.merge(df_left, df_right, on='key', how='inner')
merged_df

  key  value_left  value_right
0   A           1            4
1   B           2            5

## Task 2: Try outer, left and right join operations

## Grouping operations

In [27]:
import pandas as pd

# Sample data
df = pd.DataFrame({
    'Department': ['IT', 'HR', 'IT', 'Sales', 'Sales'],
    'Salary': [5000, 6000, 5500, 6500, 6200]
})

# Group by Department and compute average salary
avg_salary = df.groupby('Department').mean()
avg_salary

            Salary
Department
HR            6000
IT            5250
Sales         6350

## Task 3: Try other aggregation functions

In [28]:
import pandas as pd

# Sample data
df = pd.DataFrame({
    'Department': ['IT', 'HR', 'IT', 'Sales', 'Sales'],
    'Salary': [5000, 6000, 5500, 6500, 6200],
    'Experience': [3, 2, 5, 1, 4]
})

# Aggregate multiple metrics for each department
agg_results = df.groupby('Department').aggregate({
    'Salary': ['mean', 'max'],
    'Experience': 'median'
})

agg_results

           Salary       Experience
             mean   max     median
Department
HR           6000  6000        2.0
IT           5250  5500        4.0
Sales        6350  6500        2.5

In [38]:
import pandas as pd

import numpy as np


# Creating a DataFrame from a dictionary

data = {
'Name': ['Alice', 'Bob', 'Charlie', 'David','Sarah'],
'Age': [25, 30, 22, 35,np.NaN],
'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer', 'Doctor'], 
'Salary': [50000, 60000, 70000, np.NaN, 90000]
}

df = pd.DataFrame(data)



# Get Summary statistics

df.describe()

             Age        Salary
count   4.000000      4.000000
mean   28.000000  67500.000000
std     5.715476  17078.251277
min    22.000000  50000.000000
25%    24.250000  57500.000000
50%    27.500000  65000.000000
75%    31.250000  75000.000000
max    35.000000  90000.000000

In [39]:
df

      Name   Age Occupation   Salary
0    Alice  25.0   Engineer  50000.0
1      Bob  30.0     Doctor  60000.0
2  Charlie  22.0    Teacher  70000.0
3    David  35.0     Lawyer      NaN
4    Sarah   NaN     Doctor  90000.0

In [40]:
# Checking for rows with missing values

df.isna().sum()

Name          0
Age           1
Occupation    0
Salary        1
dtype: int64

In [41]:

# Imputing missing values with the mean

df['Salary'].fillna(df['Salary'].mean(), inplace=True)

In [42]:
df

      Name   Age Occupation   Salary
0    Alice  25.0   Engineer  50000.0
1      Bob  30.0     Doctor  60000.0
2  Charlie  22.0    Teacher  70000.0
3    David  35.0     Lawyer  67500.0
4    Sarah   NaN     Doctor  90000.0

In [43]:
# Creating another dataframe

df_salary = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie', 'David'],'Salary': [50000, 45000, 42000, 60000]})



# merging the dataframes

merged_data = pd.merge(df_salary, df, on='Name', how='inner')

merged_data.head()

      Name  Salary_x   Age Occupation  Salary_y
0    Alice     50000  25.0   Engineer   50000.0
1      Bob     45000  30.0     Doctor   60000.0
2  Charlie     42000  22.0    Teacher   70000.0
3    David     60000  35.0     Lawyer   67500.0